;; -*- no-byte-compile: t; -*-
;;; private/amos/packages.el
(package! evil-commentary :ignore t)
(package! vi-tilde-fringe :ignore t)
(package! stripe-buffer :ignore t)
(package! git-gutter-fringe :ignore t)
(package! centered-window-mode :recipe (:fetcher github :repo "amosbird/centered-window-mode"))
(package! evil-terminal-cursor-changer :recipe (:fetcher github :repo "amosbird/evil-terminal-cursor-changer"))
(package! evil-textobj-line :recipe (:fetcher github :repo "syohex/evil-textobj-line"))
(package! osc :recipe (:fetcher github :repo "amosbird/osc.el"))
(package! ivy-rich :recipe (:fetcher github :repo "Yevgnen/ivy-rich"))
(package! cnfonts)
(package! chinese-yasdcv)
(package! git-gutter)
(package! evil-nerd-commenter)
(package! narrow-reindent)
(package! fcitx)
(package! sdcv)
(package! pangu-spacing)
(package! counsel-dash)
(package! easy-hugo)
(package! link-hint)
(package! lispyville)
(package! move-text)
(package! ws-butler)
(package! fish-mode)
(package! evil-magit)
