;; -*- no-byte-compile: t; -*-
;;; lang/cc/packages.el

(package! cmake-ide)
(package! cuda-mode)
(package! demangle-mode)
(package! disaster)
(package! glsl-mode)
(package! rtags)
(package! opencl-mode)
(package! modern-cpp-font-lock)
(package! company-glsl :recipe (:fetcher github :repo "Kaali/company-glsl"))
